<a href="https://colab.research.google.com/github/aadityasomani/Aadi/blob/master/Lesson_35_The_datetime_Module_Aditya.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Lesson 35: The `datetime` Module

---

### Teacher-Student Tasks

Let's quickly learn about the features and functions of `datetime` module which is a dedicated module for working with `datetime` objects in Python. Then we will continue with the air quality analysis project.

---

#### Task 1: The `datetime.now()` function

The `datetime` module allows us to create date and time objects and manipulate them as we desire. Let's start with importing the `datetime` module.

In [2]:
# S1.1: Import the 'datetime' module.
import datetime

Let's now print the current date and time using the `datetime.now()`. It returns the current time in Greenwich Mean Time (GMT) or Coordinated Universal Time (UTC) time zone. 

The syntax for using the `datetime.now()` function is `datetime.datetime.now()` where the first occurrence of `datetime` denotes the module name and its second occurrence denotes the object type.

**Note:** The default format of the `datetime` object is `YYYY-MM-DD HH:MM:SS` where 

- `YYYY` denotes year, 

- `MM` denotes month, 

- `DD` denotes day, 

- `HH` denotes hours in 24-hours, 

- `MM` denotes minutes, and 

- `SS` denotes seconds

In [5]:
# S1.2: Get the current time, print it and its data-type.
current_dt=datetime.datetime.now()
print(f'Current Date Time:{current_dt}\nType={type(current_dt)}')

Current Date Time:2021-12-22 12:33:33.300561
Type=<class 'datetime.datetime'>

The fractional value in the above time is microseconds. That's the level of precision of a `datetime` object.
 
You can apply the `day, month, year, hour, minute` and `second` attributes to get the corresponding day, month, year, hour, minute and second values.

In [6]:
# S1.3: Get the corresponding day, month, year, hour, minute and second values. Print the values.
print(f'day={current_dt.day}\nmonth={current_dt.month}\nYear={current_dt.year}\nHour={current_dt.hour}\nMinute={current_dt.minute}\nSecond={current_dt.second}')

day=22
month=12
Year=2021
Hour=12
Minute=33
Second=33

As you can see, we have got the following details:

- Current number of the day (in a month) using the `day` attribute.

- Current month (in numeric format) using the `month` attribute.

- Current year using the `year` attribute.

- Current hour using the `hour` attribute.

- Current minute using the `minute` attribute.

- Current second using the `second` attribute.

---

#### Task 2: The `timedelta` Object

To get time in Indian Standard Time (IST) time zone, we have to add 5 hours and 30 minutes to the UTC time because IST is equivalent to UTC+5:30. For this, we need to use the `timedelta` object. It represents a duration, the difference between two dates or times.

Inside the `timedelta` object, you may pass any one of the following parameters (or arguments).

- `days`,

- `seconds=0`,

- `microseconds`, 

- `milliseconds`,

- `minutes`, 

- `hours`, and

- `weeks`

The default value of each of the above parameters is zero. Let's pass `hours=5` and `minutes=30` parameters to the `timedelta` object. Then add it to the current time.

In [9]:
# S2.1: Get the current time in IST (or UTC+5:30) time zone. Print it and its data-type.
ist=datetime.datetime.now()+datetime.timedelta(hours=5,minutes=30)
print(f'{ist}\ntype={type(ist)}')

2021-12-22 18:09:14.934451
type=<class 'datetime.datetime'>

You can also convert the datetime in any time zone by simply adding or subtracting the hours and minutes values from the current time. As a practice, let's convert the current time in the UTC-7:00 zone. It's the time zone for the pacific region of the USA. The silicon valley is located in the same regions.

In [11]:
# S2.2: Get the current time in the UTC-7 time zone.
usa=datetime.datetime.now()-datetime.timedelta(hours=7)
print(f'{usa}\ntype={type(ist)}')

2021-12-22 05:40:26.067979
type=<class 'datetime.datetime'>

---

#### Task 3: The `datetime.strftime()` Function

The current date and time values are `datetime` objects. Let's convert them into a string value using the `strftime()` function in the `Month Day, Year HH:MM:SS AM/PM` format where `HH` hours in 12-hour format. 

Click on the link provided below to get the format codes.

[The `strftime()` & `strptime()` Format Codes](https://docs.python.org/3/library/datetime.html#strftime-and-strptime-behavior)

**Note:** You may choose any other format of your liking to format a date and time value.

In [12]:
# S3.1 Convert the current date and time into a string. Also print the data-type of the final value.
ist_str=ist.strftime("%B %d,%Y %I:%M:%S %p")
print(f'{ist_str}\nType={type(ist_str)}')

December 22,2021 06:09:14 PM
Type=<class 'str'>

As you can see, we have converted the date and time values into a string in the desired format.

---

#### Task 4: The `date()` & `time()` Functions

Let's first separate the date and time values from the current `datetime` object using the `date()` and `time()` functions respectively. 

Also, let's convert the date and time values into string and format them in the `Month Day, Year` and `HH:MM:SS AM/PM` date and time formats respectively.

In [13]:
# S4.1: Separate the date and time values from the 'datetime' object. Convert them into string. Print the final values and their data-types.
date=ist.date().strftime("%B %d,%Y")
time=ist.time().strftime("%I:%M:%S %p")
print(f'Date={date}\nTime={time}')

Date=December 22,2021
Time=06:09:14 PM

Hence we have successfully seperated the date and time using the `date()` and `time()` functions respectively.

---

#### Task 5: The `datetime.strptime()` Function

We can create a `datetime` object by passing the string values to the `strptime()` function.

As an example, let's create a `datetime` object for the date December 26, 2019. It was the day when the Earth observed the latest annular solar eclipse at around 0334 hours (GMT) in Saudi Arabia. 

The `strptime()` function requires two parameters:  

- The `datetime` object as a string

- The combination of format codes for the passed `datetime` object. E.g., if the datetime object is `May 04, 2020 06:14:48 PM`, then the required combination format codes is `'%B %d, %Y %I:%M:%S %p'`

In [14]:
# S5.1: Create a datetime object by passing the string values to the 'strptime()' function. Also, print the data-type of the object.
lat_solar_eclipse=datetime.datetime.strptime("Dec 26,2019 03:34:00","%b %d,%Y %I:%M:%S")
print(f'{lat_solar_eclipse}\ntype={type(lat_solar_eclipse)}')

2019-12-26 03:34:00
type=<class 'datetime.datetime'>

**Fun Fact:** An eclipse repeats itself in approximately 6,585.3 days.

So, we can determine the date and time for the next occurrence of the annular solar eclipse that was observed on 26 December 2019.

In [15]:
# S5.2: Determine the date and time for the next occurrence of the annular solar eclipse that was observed on 26 December 2019.
next_solar_eclipse=lat_solar_eclipse+datetime.timedelta(days=6585.3)
print(next_solar_eclipse)

2038-01-05 10:46:00

So, the last annular solar eclipse will repeat on 5 January 2038 at about 10:47 AM.

Here is a snapshot: 

<img src='https://i.imgur.com/onLwqAY.png' width=250>

*Image Credits: https://eclipse.gsfc.nasa.gov/5MCSE/5MCSE-Maps-10.pdf*

---

#### Task 6: Only `dates` & `times`

We can create separate `datetime.date` and `datetime.time` objects by passing values to the `date()` and `time()` functions.

In [16]:
# S6.1 Create only a 'datetime.date' object for your birthday. Print it and its data-type.
my_birthday=datetime.date(1999,11,8)
print(f'{my_birthday}\ntype={type(my_birthday)}')

1999-11-08
type=<class 'datetime.date'>

In [20]:
# S6.2 Create only a 'datetime.time' object for any random time. Print it and its data-type.
my_birthdayt=datetime.time(hour=8,minute=00,second=8)
print(f'{my_birthdayt}\ntype={type(my_birthdayt)}')

08:00:08
type=<class 'datetime.time'>

---

#### Task 7: Continuing Air Quality Analysis

Let's continue with the air quality analysis. We need to load the dataset, remove the `Unnamed: 15` & `Unnamed: 16` columns and drop the null values.

Also, in the previous class, we created a new Pandas series containing the concatenated date and time values.

In [21]:
# S7.1: Run the code cell.
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

# Loading the dataset
csv_file = 'https://student-datasets-bucket.s3.ap-south-1.amazonaws.com/whitehat-ds-datasets/air-quality/AirQualityUCI.csv'
df = pd.read_csv(csv_file, sep=';')

# Dropping the 'Unnamed: 15' & 'Unnamed: 16' columns
df = df.drop(columns=['Unnamed: 15', 'Unnamed: 16'], axis=1) 

# Dropping the null values
df = df.dropna()

# Creating a Pandas series containing 'datetime' objects.
dt_series = pd.Series(data = [item.split("/")[2] + "-" + item.split("/")[1] + "-" + item.split("/")[0] for item in df['Date']], index=df.index) + ' ' + pd.Series(data=[str(item).replace(".", ":") for item in df['Time']], index=df.index)
dt_series = pd.to_datetime(dt_series)
dt_series

0      2004-03-10 18:00:00
1      2004-03-10 19:00:00
2      2004-03-10 20:00:00
3      2004-03-10 21:00:00
4      2004-03-10 22:00:00
               ...
9352   2005-04-04 10:00:00
9353   2005-04-04 11:00:00
9354   2005-04-04 12:00:00
9355   2005-04-04 13:00:00
9356   2005-04-04 14:00:00
Length: 9357, dtype: datetime64[ns]

Let's remove the `Date` & `Time` columns from the DataFrame because we don't need them and insert the `dt_series` in it because it contains the `datetime` objects.

In [22]:
# S7.2 Display the first five rows of the DataFrame before removing the 'Date' and 'Time' columns.
df.head()

         Date      Time CO(GT)  PT08.S1(CO)  ...  PT08.S5(O3)     T    RH      AH
0  10/03/2004  18.00.00    2,6       1360.0  ...       1268.0  13,6  48,9  0,7578
1  10/03/2004  19.00.00      2       1292.0  ...        972.0  13,3  47,7  0,7255
2  10/03/2004  20.00.00    2,2       1402.0  ...       1074.0  11,9  54,0  0,7502
3  10/03/2004  21.00.00    2,2       1376.0  ...       1203.0  11,0  60,0  0,7867
4  10/03/2004  22.00.00    1,6       1272.0  ...       1110.0  11,2  59,6  0,7888

[5 rows x 15 columns]

Let's add the `dt_series` Pandas series to the DataFrame at `index = 0`. Also, let's label it as a `DateTime` column.

In [27]:
# S7.3: Remove the Date & Time columns from the DataFrame and insert the 'dt_series' in it.
#df=df.drop(columns=['Date','Time'],axis=1)
df.insert(loc=0,column="DateTime",value=dt_series)

In [28]:
# S7.4: Display the first five rows of the DataFrame after removing the 'Date' 7 'Time' columns and adding the 'DateTime' column.
df.head()

             DateTime CO(GT)  PT08.S1(CO)  ...     T    RH      AH
0 2004-03-10 18:00:00    2,6       1360.0  ...  13,6  48,9  0,7578
1 2004-03-10 19:00:00      2       1292.0  ...  13,3  47,7  0,7255
2 2004-03-10 20:00:00    2,2       1402.0  ...  11,9  54,0  0,7502
3 2004-03-10 21:00:00    2,2       1376.0  ...  11,0  60,0  0,7867
4 2004-03-10 22:00:00    1,6       1272.0  ...  11,2  59,6  0,7888

[5 rows x 14 columns]

---

#### Task 8: Extract Year, Month, Day & Weekday Values

Let's add four more columns to the DataFrame. The should contain the year, month, day and day-name values for each observation on the air pollutants, temperature, relative humidity and absolute humidity.

For this you can apply the following attributes/functions:

- `series_name.dt.year` to get a Pandas series containing the year values as integers.

- `series_name.dt.month` to get a Pandas series containing the month values as integers.

- `series_name.dt.day` to get a Pandas series containing the day values as integers.

- `series_name.dt.day_name()` to get a Pandas series containing the days of a week, i.e., Monday, Tuesday, Wednesday etc.

In [29]:
# S8.1: Get the Pandas series containing the year values as integers.
year_series=dt_series.dt.year
print(year_series)

0       2004
1       2004
2       2004
3       2004
4       2004
        ...
9352    2005
9353    2005
9354    2005
9355    2005
9356    2005
Length: 9357, dtype: int64

In [30]:
# S8.2: Get the Pandas series containing the month values as integers.
month_series=dt_series.dt.month
print(month_series)

0       3
1       3
2       3
3       3
4       3
       ..
9352    4
9353    4
9354    4
9355    4
9356    4
Length: 9357, dtype: int64

In [31]:
# S8.3: Get the Pandas series containing the day values as integers.
day_series=dt_series.dt.day
print(day_series)

0       10
1       10
2       10
3       10
4       10
        ..
9352     4
9353     4
9354     4
9355     4
9356     4
Length: 9357, dtype: int64

In [32]:
# S8.4: Get the Pandas series containing the days of a week, i.e., Monday, Tuesday, Wednesday etc.
weekday_series=dt_series.dt.day_name()
print(weekday_series)

0       Wednesday
1       Wednesday
2       Wednesday
3       Wednesday
4       Wednesday
          ...
9352       Monday
9353       Monday
9354       Monday
9355       Monday
9356       Monday
Length: 9357, dtype: object

We can add a column to a DataFrame by following the syntax given below.

**Syntax to add a new column:** `df_name['column_name'] = pandas_series`

Where `df_name` is the Pandas DataFrame in which the `pandas_series` to added as a column with the `column_name` as the desired name for the column.

**Note:** The indices of the items contained in the `pandas_series` must be the same as the indices of the `df_name` DataFrame.

In [33]:
# S8.5: Add the 'Year', 'Month', 'Day' and 'Day Name' columns to the DataFrame.
df['Year']=year_series
df['Month']=month_series
df['Day']=day_series
df['DayName']=weekday_series

Let's display the first five rows of the DataFrame after adding the new columns.

In [34]:
# S8.6: Display the first five rows of the DataFrame after adding the new columns.
df.head()

             DateTime CO(GT)  PT08.S1(CO)  ...  Month Day    DayName
0 2004-03-10 18:00:00    2,6       1360.0  ...      3  10  Wednesday
1 2004-03-10 19:00:00      2       1292.0  ...      3  10  Wednesday
2 2004-03-10 20:00:00    2,2       1402.0  ...      3  10  Wednesday
3 2004-03-10 21:00:00    2,2       1376.0  ...      3  10  Wednesday
4 2004-03-10 22:00:00    1,6       1272.0  ...      3  10  Wednesday

[5 rows x 18 columns]

Let's sort the DataFrame by the `DateTime` values in the ascending order by using the `sort_values()` function. Inside the function, you need to pass the `by = 'DateTime'` parameter to sort the DataFrame by the `DateTime` values.

**Note:** By default, the `sort_values` function sorts a DataFrame in the ascending order. To sort it in the descending order, pass `ascending=False` as the second parameter inside the `sort_values` function.

In [36]:
# S8.7: Sort the DataFrame by the 'DateTime' values in the ascending order. Also, display the first 10 rows of the DataFrame.
df=df.sort_values(by="DateTime")
df.head(10)

             DateTime CO(GT)  PT08.S1(CO)  ...  Month Day    DayName
0 2004-03-10 18:00:00    2,6       1360.0  ...      3  10  Wednesday
1 2004-03-10 19:00:00      2       1292.0  ...      3  10  Wednesday
2 2004-03-10 20:00:00    2,2       1402.0  ...      3  10  Wednesday
3 2004-03-10 21:00:00    2,2       1376.0  ...      3  10  Wednesday
4 2004-03-10 22:00:00    1,6       1272.0  ...      3  10  Wednesday
5 2004-03-10 23:00:00    1,2       1197.0  ...      3  10  Wednesday
6 2004-03-11 00:00:00    1,2       1185.0  ...      3  11   Thursday
7 2004-03-11 01:00:00      1       1136.0  ...      3  11   Thursday
8 2004-03-11 02:00:00    0,9       1094.0  ...      3  11   Thursday
9 2004-03-11 03:00:00    0,6       1010.0  ...      3  11   Thursday

[10 rows x 18 columns]

In [37]:
df.tail()

                DateTime CO(GT)  PT08.S1(CO)  ...  Month Day  DayName
9352 2005-04-04 10:00:00    3,1       1314.0  ...      4   4   Monday
9353 2005-04-04 11:00:00    2,4       1163.0  ...      4   4   Monday
9354 2005-04-04 12:00:00    2,4       1142.0  ...      4   4   Monday
9355 2005-04-04 13:00:00    2,1       1003.0  ...      4   4   Monday
9356 2005-04-04 14:00:00    2,2       1071.0  ...      4   4   Monday

[5 rows x 18 columns]

Let's pause here. In the next class, we will continue the same project with more data cleaning exercises because a few of the columns contain decimal values separated by a comma and all the columns also contain `-200`; a garbage value.

---